# 기술면접 대비

## 학습방법
  1. CS/인성면접/React/spring/javascript/java로 나누어서 정리
  2. 이해하고 있지 않은 부분은 체크하여 결전의 날 전에 확인
  3. 키워드 노트 답안 아래에 작성

### CS
1. HTTP의 원리에 대해 설명해주실 수 있을까요?
#### 정보링크: https://www.cloudflare.com/ko-kr/learning/ssl/what-is-https/
-  ★ 내가 알고 있는 부분: 보안이 강화된 로컬호스트주소입니다.
- ★★  모범답안: 하이퍼텍스트 전송 프로토콜 보안이라고 한다. 웹브라우저와 웹사이트 간에 데이터를 전송하는데 사용되는 기본 HTTP의 보안 버전입니다.
- 어디서 사용되는가? 로그인 자격증명이 필요한 웹사이트, 은행계좌,이메일 서비스,의료 보험 공급자에 로그인 하는 등
- ★★★ 어떻게 작동하는가?
개인키와 공개키 두가지(SSL인증서)를 사용하는데 이것을 **비대칭공개 키 인프라**로 알려진 것을 사용하여  핸드셰이크라는 프로세스를 거쳐 통신거치며. 두 당사자 간의 통신을 암호화한다.
- HTTP: 암호화 전  => 텍스트형식
- HTTPS: 암호화 후 => 문자+ 숫자 + 특수문자
- 사용하는 포트: HTTPS에서 사용하는 포트  

